#include <stdio.h> //подключает библиотеку
// библиотека ввода-вывода
//stdin, stdout, stderror
// int - тип данных(целое число) %d, char-символ %c, float & double - 3.14 %f %lf
int main(void)//главная функция
{
int count;//объявление переменной
count = 5;//присваивание значения
//у инта диапозон значений от короче много
unsigned int new_count;//объявили переменную
new_count = 3000000000;// = это оператор присваивания, от 0 до 4294000000
int check=2,kek=1;//вот так можно тоже
char a = 'A';
a = 37;
double b = 3.14;
printf("%lf", b);

}// выполняется досюда

